app/controllers/groups_controller.rb

  def index
    @user = current_user
    @groups = current_user.groups
---
SELECT `groups`.* FROM `groups` INNER JOIN `group_users` ON `groups`.`id` = `group_users`.`group_id` WHERE `group_users`.`user_id` = 9

  def new
    @group = Group.new
    @user = User.find(selected_user_params[:selected_user_id]) if selected_user_params[:selected_user_id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 9 ORDER BY `users`.`id` ASC LIMIT 1

  def create
    binding.pry
    @group = Group.create(group_params)
---
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('hogehogehogehoge', '2017-12-10 14:36:52', '2017-12-10 14:36:52')