app/controllers/messages_controller.rb

SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 69
---
  def index
    @members = @group.users.map(&:name).join(' ')

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 69 LIMIT 1
---
  def set_group
    @group = Group.find(params[:group_id])